[
  {
    "ar": "تذكر دائما العضلات لا تنمو في يوم بل تنمو بفضل الانضباط والالتزام",
    "en": "Remember, muscles don’t grow in one day; they grow through discipline and consistency."
  },
  {
    "ar": "لا تهمل الاحماء قبل التمرين فهو يحميك من الاصابات",
    "en": "Never skip your warm-up; it protects you from injuries."
  },
  {
    "ar": "الماء هو صديقك الاول تذكرها جيدا",
    "en": "Water is your first and best friend—never forget that."
  },
  {
    "ar": "لا تقارن نفسك بغيرك فكل جسم له رحلته الخاصة",
    "en": "Don’t compare yourself to others; every body has its own journey."
  },
  {
    "ar": "النوم الجيد نصف التمارين بدون الراحة لاتبنى العضلات",
    "en": "Good sleep is half the workout—muscles don’t grow without rest."
  },
  {
    "ar": "التكرار هو المفتاح فكل مجموعة اضافية تقربك من هدفك",
    "en": "Repetition is the key; every extra set brings you closer to your goal."
  },
  {
    "ar": "كل قطرة تعرق هي انجاز ستفخر به غدا",
    "en": "Every drop of sweat is an achievement you'll be proud of tomorrow."
  },
  {
    "ar": "التغذية الجيدة ليست اختيار, انها اساس",
    "en": "Good nutrition isn’t optional; it’s the foundation."
  },
  {
    "ar": "لا تتمرن لتعجب الاخرين بل لتصنع نسخة افضل من نفسك",
    "en": "Don’t train to impress others; train to become a better version of yourself."
  },
  {
    "ar": "لا يبنى النجاح على المقارنة, نسخة افضل من نفسك هي النجاح",
    "en": "Success is not built on comparison; becoming a better you is the true success."
  },
  {
    "ar": "لاتنسى تمديد عضلاتك بعد التمرين, فهي سر التعافي السريع",
    "en": "Don’t forget to stretch after your workout; it’s the secret to faster recovery."
  },
  {
    "ar": "في كل مرة تفكر بالاستسلام تذكر لماذا بدات",
    "en": "Whenever you feel like giving up, remember why you started."
  },
  {
    "ar": "استمر . الثبات اهم من السرعة",
    "en": "Keep going—consistency matters more than speed."
  },
  {
    "ar": "لا تقل لا استطيع , حاول مرة اخرى",
    "en": "Don’t say 'I can’t'; try again."
  },
  {
    "ar": "تناول البروتين بعد التمرين يساعد عضلاتك على النمو",
    "en": "Eating protein after your workout helps your muscles grow."
  },
  {
    "ar": "لا تكتفي بالتمرين اجعل الرياضة نمط حياة",
    "en": "Don’t settle for just training—make fitness a lifestyle."
  },
  {
    "ar": "خذ وقتك بين المجموعات فالاستراحة جزء من الاداء الصحيح",
    "en": "Take your time between sets; rest is part of proper performance."
  },
  {
    "ar": "كل يوم جديد فرصة لتكون افضل من الامس",
    "en": "Every new day is a chance to be better than yesterday."
  },
  {
    "ar": "التمرين ينتهي عندما تعيد الاوزان الى مكانها",
    "en": "Your workout ends only after you put the weights back."
  },
  {
    "ar": "لا تتخطى تمرين فهو اساس القوة والثبات",
    "en": "Never skip a workout—it’s the foundation of strength and stability."
  },
  {
    "ar": "راقب تقدمك بالارقام , فهي النتيجة الحقيقية",
    "en": "Track your progress with numbers—they show the real results."
  },
  {
    "ar": "يلا يا بطل… كل عدة عم تبني قصة نجاح جديدة!",
    "en": "Come on champ… every rep builds a new success story!"
  },
  {
    "ar": "لا توقف… آخر 10% من التمرين هنّي اللي بيعملوا الفرق!",
    "en": "Don’t stop… the last 10% of the workout is where the real difference happens!"
  },
  {
    "ar": "ركز على نفسك… جسمك عم يسمعك، شدّ عليه!",
    "en": "Focus on yourself… your body is listening, push it!"
  },
  {
    "ar": "اليوم تمرين، بكرا إنجاز. كمل!",
    "en": "Today's workout is tomorrow’s achievement. Keep going!"
  },
  {
    "ar": "لا تفوّت وجبتك… جسمك بحاجة وقود ليصير نسخة أقوى!",
    "en": "Don’t skip your meal; your body needs fuel to become stronger!"
  },
  {
    "ar": "وجبتك اليوم استثمار… مو عبء.",
    "en": "Your meal today is an investment, not a burden."
  },
  {
    "ar": "مو مهم وين بلشت… المهم لوين ناوي توصل.",
    "en": "Where you started doesn’t matter—where you're going does."
  },
  {
    "ar": "خطوة صغيرة اليوم… أحسن من لاشيء.",
    "en": "A small step today is better than no step at all."
  },
  {
    "ar": "توقّفت دقيقة؟ ولا يهمك… المهم إنك ما تستسلم.",
    "en": "Stopped for a minute? No worries… what matters is you don’t quit."
  },
  {
    "ar": "ركز معي… النجاح عادة، مو صدفة.",
    "en": "Focus with me… success is a habit, not luck."
  },
  {
    "ar": "انت لاعب يونيسيبس… يعني الاستمرار جزء منك!",
    "en": "You’re a Uniceps athlete… consistency is part of who you are!"
  },
  {
    "ar": "أهلا بالأسطورة! جاهز نكمّل المشوار؟",
    "en": "Welcome, legend! Ready to continue the journey?"
  },
  {
    "ar": "عملت إنجاز جديد! خلّيني فخور فيك أكثر.",
    "en": "You achieved something new! Let me be even prouder of you."
  },
  {
    "ar": "اليوم يومك، وأنا معك خطوة بخطوة.",
    "en": "Today is your day, and I’m with you step by step."
  },
  {
    "ar": "جاهز نطوّر جسمك؟ يلا نبدأ!",
    "en": "Ready to develop your body? Let’s get started!"
  }
]