Repository: Nero-code/Uniceps-mobile
Catalog: lib/core/l10n/app_*.arb
Languages: ar

# hello
source: Hi,
ar: مرحبا,

source: Welcome
ar: اهلا بك

source: Sign in
ar: تسجيل الدخول

source: Login
ar: تسجيل الدخول

source: Forgot Password?
ar: نسيت كلمة السر؟

source: Email
ar: البريد الالكتروني

# emailError
source: Please enter your E-mail Address
ar: الرجاء ادخال البريد الالكتروني

source: Password
ar: كلمة السر

# passwordError
source: Please enter a password
ar: الرجاء ادخال كلمة السر

source: Verify
ar: تأكيد

source: Verify Code
ar: تأكيد الكود

source: Code
ar: الكود

# codeError
source: Invalid Code!
ar: الكود خاطئ!

source: Change Password
ar: تغيير كلمة السر

# gymBoxTitle
source: Please type in the code the Gym Gave you
ar: الرجاء ادخال الكود المأخوذ من النادي

# authBoxTitle
source: Please enter your email
ar: الرجاء ادخال البريد الالكتروني

# profileTitle
source: Tell us about yourself
ar: اخبرنا عن نفسك

source: OK
ar: موافق

source: No
ar: لا

source: OR
ar: أو

source: Cancel
ar: الغاء

source: SKIP >
ar: تخطي <

source: Confirm
ar: تأكيد

source: Add
ar: اضافة

source: Edit
ar: تعديل

source: Update
ar: تعديل

source: Reorder
ar: اعادة ترتيب

# newVersion
source: New Version Available
ar: يوجد تحديث جديد!

source: Save
ar: حفظ

source: Level:
ar: المستوى:

source: Apply
ar: تطبيق

source: Search
ar: بحث

source: Active
ar: فعال

source: Nothing Changed
ar: لا يوجد تغيير في البيانات

source: Logout
ar: تسجيل الخروج

# logoutAlert
source: Logout?
ar: تسجيل الخروج؟

# logoutAlertContents
source: You are about to Logout of the app some of your data may be lost, Are you sure?
ar: انت الأن على وشك تسجيل الخروج, قد تتعرض معلوماتك للحذف, هل انت متأكد؟

source: Download
ar: تنزيل

source: Rename
ar: تغيير الاسم

source: Set Current
ar: تفعيل

source: Remove
ar: ازالة

source: Delete
ar: حذف

source: Finish
ar: انهاء

# finishAlertContent
source: have you finished training? this session will be closed and marked as finished!
ar: هل انتهيت من التدريب؟ سيتم اغلاق هذه الجلسة وتصنيفها ك منتهية!

source: Well Done!
ar: احسنت!

source: Great!
ar: رائع!

source: Record
ar: سجل

source: Before
ar: قبل

source: After
ar: بعد

source: Apply to all
ar: تطبيق للكل

# dayLimitAlert
source: Login to get 3 free days
ar: سجل دخولك لتحصل على 3 ايام مجانية

# routineLimitAlert
source: Login to add routines
ar: سجل دخولك لتتمكن من تصنيع البرامج

# captainUniUpgradeQuote
source: Are you ready to head to the top? This is not just an upgrade... it's a map to your stronger and smarter version
ar: هل أنت مستعد لتنطلق نحو القمة؟ ​هذه ليست مجرد ترقية... إنها الخريطة الحقيقية لنسختك الأقوى والأذكى

source: Import Routine
ar: استيراد برنامج

# importRoutineAlertContent
source: Make sure you have a file with .unx extension, then import it.
ar: تاكد من وجود ملف ذو لاحقة .unx في جهازك, ثم قم باستيراده.

source: Sessions
ar: الجلسات

source: Sessions Report
ar: تقرير الجلسات

source: Weights Report
ar: تقرير الاوزان

source: Exercise Density
ar: كثافة التمرين

source: Exercise Intensity
ar: شدة التمرين

source: Exercise Volume
ar: حجم التمرين

source: Physical Report
ar: التقرير الجسدي

# progressRate
source: Preogress Rate
ar: معدل الانجاز

source: Price
ar: السعر

source: Discount
ar: الحسم

source: Status
ar: الحالة

source: Address
ar: العنوان

source: owner
ar: المالك

source: Telephone
ar: الهاتف

source: Subscription
ar: الأشتراكات

source: Subscriptions
ar: الأشتراكات

source: Balance
ar: الرصيد

source: Sport
ar: الرياضة

source: Measurements
ar: القياسات

source: Language
ar: اللغة

source: Calender
ar: التقويم

source: List
ar: قائمة

source: Attendence Log
ar: سجل الحضور

source: Add Exercise
ar: اضافة تمرين

source: Add Routine
ar: اضافة برنامج

# scrTitleMyRoutines
source: My Routines
ar: البرامج الرياضية

# scrTitleProfile
source: Profile
ar: الحساب الشخصي

# scrTitleSettings
source: Settings
ar: الاعدادات

# scrTitlePerformance
source: Performance
ar: الاداء

# scrTitleCompareTool
source: Compare Tool
ar: اداة المقارنة

# setsAndRounds
source: Sets & Rounds
ar: العدات والجولات

source: No file selected
ar: لم يتم تحديد ملف

# unsupportedVersion
source: Unsupported version of selected file
ar: اصدار الملف غير مدعوم

# parserMismatch
source: Unexpected file content
ar: محتويات الملف غير متوقعة

# corruptedFile
source: Cannot open, the file is Corrupted
ar: تعذر الفتح, الملف تالف

# startingImport
source: Openning File...
ar: جاري فتح الملف...

# gettingImagesImport
source: Getting Images...
ar: جاري تنزيل الصور...

# addingDaysImport
source: Adding Days...
ar: جاري اضافة الايام...

# addingItemsImport
source: Adding Exercises...
ar: جاري اضافة التمارين...

# addingSetsImport
source: Adding Sets...
ar: جاري اضافة الجولات...

# done
source: Import Successful
ar: تمت العملية بنجاح

# chooseLang
source: Choose Language:
ar: اختر اللغة:

source: About
ar: حول

source: Gyms
ar: النوادي

source: Trainer
ar: المدرب

source: Height
ar: الطول

# heightError
source: Please put a valid Height
ar: ضع طولك

source: Weight
ar: الوزن

source: Last Weight
ar: آخر وزن

source: Arms
ar: الذراعين

# lArm
source: Left Arm
ar: ذراع يسرى

# rArm
source: Right Arm
ar: ذراع يمنى

source: Humerus
ar: الساعدين

# lHumerus
source: Left Humerus
ar: ساعد أيسر

# rHumerus
source: Right Humerus
ar: ساعد أيمن

source: Legs
ar: الارجل

# lLeg
source: Left Leg
ar: ساق يسرى

# rLeg
source: Right Leg
ar: ساق يمنى

source: Thighs
ar: الفخذين

# lThigh
source: Left Thigh
ar: فخذ أيسر

# rThigh
source: Right Thigh
ar: فخذ أيمن

source: Nick
ar: العنق

source: Shoulders
ar: الاكتاف

source: Waist
ar: الخصر

source: Chest
ar: الصدر

source: Hips
ar: الارداف

source: Check Date
ar: تاريخ الصدور

source: Entered At
ar: وقت الدخول

source: Exited At
ar: وقت الخروج

# codeNum
source: Code Number
ar: رقم الكود

source: Reps
ar: العدات

# empty
source: No Records to show
ar: المحتوى فارغ

# emptySubs
source: No Subscriptions
ar: لا يوجد اشتراكات

# emptyMeasure
source: No Measurements to compare, insert you body measurements to see the results
ar: لا يوجد قياسات لمقارنتها, ادخل مقاسات جسمك لنرى النتائج

# emptyExcercises
source: No Exercises
ar: لا يوجد تمارين

# emptySubscriptions
source: No Subscriptions yet
ar: لا يوجد اشتراكات

# emptyMeasurements
source: No Measurements yet
ar: لا يوجد قياسات حاليا

# emptyExercisesList
source: No Exercises in this Group
ar: لا يوجد تمارين لهذه المجموعة

# emptyGymsList
source: No Gyms Available
ar: لا يوجد نوادي

# emptyHandshakes
source: you are not a member of any gym
ar: لست عضوا في اي نادي

# emptyTriningDaysMap
source: No Training Program yet
ar: لا يوجد برنامج تدريبي

# emptyHomeCard
source: No Gym Specified, select a gym to load data
ar: اختر احد النوادي لعرضه

# emptyAttendence
source: Not a member
ar: لا يوجد سجل حضور

# emptyRoutineItems
source: No items, try the (+) button
ar: لا يوجد عناصر, اضغط على زر (+) لاضافة تمارين

# emptyDays
source: No days, press + to add a day!
ar: لا يوجد ايام, اضغط على + لاضافة يوم!

# emptyRoutines
source: Lets build a special workout to achieve your goals!
ar: هيا لنبني برنامج تدريبي مميز يحقق اهدافنا!

# sessionsReportNoValues
source: No sessions found for this routine, Try practicing!
ar: لا يوجد جلسات لهذا البرنامج, عد بعد التمرين!

# sessionsReportInvalidValues
source: Malformed sessions values!
ar: قيم الجلسة غير صحيحة!

# logsReportNoValues
source: No Logs found for this routine
ar: لا يوجد تقرير اداء لهذا البرنامج

# logsReportInvalidValues
source: Malformed logs!
ar: قيم الاداء غير صحيحة!

# physicalReportNoValues
source: No measurements found, Try measuring yourself!
ar: لا يوجد قياسات لديك, قم بادخال قياس!

# physicalReportInvalidValues
source: Malformed Measurements!
ar: قيم القياسات غير صحيحة!

# physicalReportDisclaimer
source: Note: these values are not completely accurate, medical information should come from professionals
ar: ملاحظة: هذه القيم ليست دقيقة, يرجى مراجعة مختصين للتاكد من هذه القيم

# error
source: something went wrong
ar: حدث خطأ ما

source: Profile
ar: الحساب

# pName
source: Name
ar: الاسم

# pNameError
source: Please Enter your Full name
ar: الرجاء ادخال الاسم الكامل

# phoneNum
source: Phone Number
ar: رقم الهاتف

# phoneNumError
source: Please Enter your Phone Number
ar: الرجاء ادخال رقم الهاتف

# birthDate
source: Date of Birth:
ar: تاريخ الميلاد:

# birthDateError
source: Please Enter your Year of Birth
ar: الرجاء ادخال سنة الميلاد

source: Gender
ar: الجنس:

# genderError
source: Please choose your Gender
ar: الرجاء اختيار الجنس

source: Male
ar: ذكر

source: Female
ar: انثى

source: Payment
ar: الدفعة

source: Paid
ar: مدفوع

source: Not Paid
ar: غير مدفوع

# remaining
source: Remainder
ar: المتبقي

source: Version Info
ar: معلومات الاصدار

source: Version
ar: رقم الاصدار

# versionDate
source: Release Date
ar: تاريخ الاصدار

source: Developers
ar: المطورون

source: Support
ar: الدعم

# supportPage
source: Our Page
ar: صفحتنا

source: FAQs
ar: الاسئلة الشائعة

source: Privacy
ar: الخصوصية

source: Privacy Policy
ar: سياسة الخصوصية

source: User Agreement
ar: اتفاقية المستخدم

source: Terms of use
ar: شروط الاستخدام

# noGymSpecified
source: you're not a member of any gym
ar: لست مسجلا في اي نادي

# noTrainingProgram
source: you don't have a training program
ar: ليس لديك برنامج تدريبي

# errNoInternet
source: No Internet Available
ar: لا يوجد اتصال بالانترنت

# errServerException
source: An error occurred from our side, try again later
ar: حدث خطأ في الخادم, الرجاء المحاولة لاحقا

# errUnknown
source: Unknown error occurred
ar: حدث خطأ غير معروف

# errOpenSessionDelete
source: you can't delete with an open session!
ar: لا يمكن الحذف بوجود جلسة فعالة!

# endOfSubDate
source: End of subscription Date
ar: تاريخ نهاية الاشتراك

# dayQuete
source: what're you going to train today?
ar: ماذا سنستهدف اليوم؟

source: Let's Start...
ar: هيا لنبدأ...

source: Day
ar: يوم

source: Date
ar: التاريخ

# map
source: Daily Routine
ar: الخطة اليومية

source: Available Gyms
ar: المنضمون لنا

# deleteBtn
source: Delete Account
ar: حذف الحساب

source: Delete Account?
ar: حذف الحساب؟

# deleteAccountContent
source: you are about to delete your account within Uniceps System, Are you sure?
ar: انت الان على وشك حذف الحساب الخاص بك لدينا, هل انت متأكد؟

# chackForUpdate
source: Checking for updates...
ar: جاري التحقق من التحديثات...

source: Getting Routine...
ar: جاري تحميل البرنامج...

source: Guest Mode
ar: الدخول كزائر

# guestModeEditErr
source: Guest mode not allowed to edit
ar: لا يمكن تعديل معلومات الزائر

source: New Routine
ar: برنامج

source: Sort Days
ar: ترتيب الايام

source: Comming Soon!
ar: قريبا!

source: Captain Uni
ar: كابتن يوني

source: Buy Now
ar: اشتري الان

# buyPlanQuestion
source: Buy Plan?
ar: شراء الباقة؟

# buyPlancontent
source: Are you sure you want to buy {planName}! the durations will accumilate if previous plan is present
ar: هل انت متاكد من شراء باقة {planName}! المدة الزمنية ستضاف الى المدة القديمة ان وجدت

# memberDurationAlart
source: you still have {count}! day(s) till {date}!
ar: بقي لديك !{count} يوم حتى تاريخ {date}!

# muscleGroup
source: Muscle Group: {group}
ar: المجموعة العضلية: {group}

# deleteAlertContent
source: Are you sure you want to delete {item}? all related items will also be deleted.
ar: هل انت متاكد من حذف {item}؟ سيتم حذف كل العناصر المرتبطة بهذا العنصر

# setCurrentAlertContent
source: Set {item} as your current Routine?
ar: هل تريد تفعيل البرنامج {item}؟

# premiumReminder
source: Your Subscription will end after {days} day(s), renew now!
ar: سوف ينتهي اشتراكك بعد {days} يوم جدد الان!

# signinAlert
source: Sign in to see all features
ar: سجل دخولك الان لتصفح كامل التطبيق

source: Upgrade
ar: تفعيل

# upgradeAlert
source: Become a Premium Member to unlock your FULL potential
ar: فعل باقة Premium من اجل افضل استفادة

# premiumAlertContent
source: Unlock ALL content with Premium
ar: استمتع بكامل الميزات مع باقة Premium

# captainUniAboutContent
source: Hello, I’m Captain Uni. I’m the virtual guide who will accompany you inside the Uniceps app, and my job is to make every step easy and your experience smooth and clear. My main role is to introduce you to the app and show you how to use each section without any confusion. I also help you choose the workout program that fits you best, so you can start your journey the right way. With every workout you complete, I collect your stats and show you your results, so you can see your progress day by day. I can’t promise to change your life overnight… but I can promise to stay by your side at every stage. I’m here to guide you, explain things, and encourage you, so you can get the most out of the app. And in the end… consider me a friend and an experienced companion walking with you step by step, happy to see you improving.
ar: أهلين فيك، أنا الكابتن يوني. أنا الشخصية يلي رح ترافقك بتطبيق يوني سيبس، وشغلي إني سهّل عليك كل خطوة وتخلّي تجربتك مريحة وواضحة. دوري الأساسي إني عرّفك على التطبيق، وورجيك كيف تستخدم كل قسم فيه بدون تعقيد. وبساعدك كمان تختار البرنامج الرياضي اللي بناسبك، لحتى تبلّش بطريقة صحيحة ومريحة لإلك. مع كل تمرين بتعمله، أنا بجمّع إحصاءاتك وبورجيك نتائجك لتشوف تقدّمك يوم بعد يوم. ما بوعدك تغيّر حياتك بيوم وليلة… بس بوعدك كون موجود جنبك بكل مرحلة. أنا هون لوجّهك، أشرحلك، وشجّعك، لحتى تستفيد من التطبيق لأقصى درجة. وبالنهاية… اعتبرني صديق وخبير عم يمشي معك خطوة بخطوة، ومبسوط يشوفك عم تتقدم.
